IsTransient Property
 Indicates whether an element is transient or permanent.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2016
 Syntax
  C#
public bool IsTransient { get; }
  Visual Basic
Public ReadOnly Property IsTransient As Boolean
	Get
  Visual C++
public:
property bool IsTransient {
	bool get ();
}
 Remarks
 Transient elements are usually created for short term use. This type of element can be created via Document.MakeTransientElements().
 Transient and Permanent elements are not allowed to reference each other. A transient element can only refer to other transient elements in the same document.
 Transient elements also cannot be selected or scheduled, and will not be saved when the document is saved, and will be discarded when the document is closed.
 Modifying a transient element does not require a transaction, because such elements are not part of the model. As an effect of this, however, creation and modification of transients cannot be undone.
 Because transient elements are technically not part of the model, they will not be found when using standard element filters, or in any collection of elements Revit returns, such as elements reported in dynamic updaters, etc.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →